app/sidekiq/load_news_job.rb

SELECT "categories".* FROM "categories"
---
  def perform(url, category)
    data = {}
    response = HTTParty.get(url)
    data["top-news"] = JSON.parse(response.body) if response.code == 200

    Category.all.each do |category|